export const GUIDE_TEXTS = {
    combat: {
        finale: "좌측 하단의 FORCE STATE 버튼을 눌러 적들의 체력이 5% 이하가 되면, 적의 초상화를 꾹 클릭해서 카드를 모은 뒤... 콰광! 💥 피날레를 날려보세요! ✨",
        multiPlay: "카드를 꾹~ 누르면 손패에 있는 동일한 카드 여러 장을 마나 만큼 한꺼번에 선택할 수 있어요! 🃏🃏 모아서 공격하면 약간의 보너스를 받아요.",
        spinning: "카드를 잡고 휙~ 하고 돌리며 놓아보세요! 🌀 패가 낮은 비용부터 순차적으로 정리돼요.",
        destinyDraw: "한 세션에 단 한번, 덱이 반짝일 때 꾹~ 누르면... 운명의 드로우가 발동해요! 위기의 순간, 기적을 믿어보세요! 🙏",
    },
    playthrough: {
        title: "Eternal Return: ClipShit에 오신걸 환영해요. 💖",
        mainMenu: "Start Operation 메뉴를 선택해주세요 ✨",
        charSelect: "함께할 실험체를 두 명 선택해주세요! 👥",
        dna: "DNA를 조합해서 특별한 능력을 얻어보세요! 🧬",
        deckConfirm: "출발하기 전에 덱을 확인해주세요! ",
        actSelect: "액트 1을 선택해주세요. 🗺️",
        map: "지도를 보고 맵 최하단의 전투 노드를 클릭해주세요!",
        battle: "전투 개시! ⚔️ 하지만 데모이기 때문에 좌측 하단의 작은 스킵 버튼을 눌러주세요 📣",
        reward: "승리했어요! 🎉 보상을 챙겨주세요! 🎁",
        mapSelectEvent: "이벤트 노드를 클릭해주세요! 🎲",
        event: "무슨 일이 일어날까요? 선택에 따라 결과가 달라져요! 🎲",
        mapSelectBoss: "보스전이 코앞이에요! 보스 전투 노드를 클릭해주세요 😨",
        bossBattle: "강력한 적이 나타났어요 🔥 하지만 데모이기 때문에 괜찮아요. 좌측 하단의 작은 스킵 버튼을 눌러주세요!",
        actClear: "대단해요! 챕터를 클리어했어요! 추출 버튼을 클릭해주세요!",
        extraction: "추출 기능을 통해, 런을 중단하고 패배시 보다 많은 보상을 획득하거나, 다음 런에 이점을 얻을 수 있어요! 💎",
        mainMenu2: "메인 메뉴로 돌아왔어요! 가챠 메뉴를 클릭해주세요!🌈",
        gacha: "제발 좋은 게 나오길... 🙏",
        memorialEnd: "메모리얼 메뉴에서는 여태까지 얻은 중요한 카드와 가젯을 확인 할 수 있어요. 플레이해주셔서 감사합니다!👋",
    }
};
